---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetProperty.RemoveConnectedAsset
source: html/1f25e33b-fd8b-692c-097d-f5eee8dfbd21.htm
---
# Autodesk.Revit.DB.Visual.AssetProperty.RemoveConnectedAsset Method

Removes the connected asset attached to this asset property if any.

## Syntax (C#)
```csharp
public void RemoveConnectedAsset()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The asset property is not editable.
 -or-
 Cannot check validity for a property not being edited in AppearanceAssetEditScope.